// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытий

&После("УстановкаПараметровСеанса")
Процедура КА2_УстановкаПараметровСеанса(ТребуемыеПараметры)

	Если ТребуемыеПараметры = Неопределено Тогда
  		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		ИспользоватьСтандартныйПоиск = Константы.ИспользоватьСтандартныйПоискПриПодбореТоваров.Получить();

		ПараметрыСеанса.КА2_КлючиМоделейПустыеПоля = КА2_КаталогАвтомобилейВызовСервера.КлючиМоделейПустыеПоля();
		ПараметрыСеанса.КА2_ПВХ = КА2_КаталогАвтомобилейВызовСервера.ПВХКаталогАвтомобилей();
		ПараметрыСеанса.КА2_ПоляКлючейМоделей = КА2_СлужебныеВызовСервера.СоответствияПолейКлючаМодели();
		ПараметрыСеанса.КА2_СигнатурыОтбора = КА2_КаталогАвтомобилейВызовСервера.СигнатурыОтбора();
		ПараметрыСеанса.КА2_ИмяГруппыФильтра = ?(ИспользоватьСтандартныйПоиск,
												 "СтандартныйПоискКоманднаяПанельУстановитьФильтр",
												 "РасширенныйПоискКоманднаяПанельУстановитьФильтр");
		ПараметрыСеанса.КА2_ПанельРазмещенияКнопки = ?(ИспользоватьСтандартныйПоиск,
													  "КаталогАвтомобилей",
													  "ГруппаКомандыСписокРасширенныйПоискНоменклатура");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти