// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ПрограммныйИнтерфейс

&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура КА2_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт

	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя = "ОтборПоКаталогуАвтомобилей";
	Вид.ИмяПодменю = ПараметрыСеанса.КА2_ИмяГруппыФильтра;
	Вид.Заголовок = НСтр("ru = 'Отбор по каталогу автомобилей'");
	Вид.Картинка = БиблиотекаКартинок.АС2_ФильтрПоАвто;

	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя = "КаталогАвтомобилей";
	Вид.ИмяПодменю = ПараметрыСеанса.КА2_ПанельРазмещенияКнопки;
	Вид.Заголовок = НСтр("ru = 'Каталог автомобилей'");
	Вид.Картинка = БиблиотекаКартинок.АС2_ФильтрПоАвто;
	Вид.Отображение = ОтображениеКнопки.Картинка;

КонецПроцедуры

&После("ПриОпределенииСоставаНастроекПодключаемыхОбъектов")
Процедура КА2_ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт

	Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
	Настройка.Ключ = "ОтборПоКаталогуАвтомобилей";
	Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
	Настройка.ВидыПодключаемыхОбъектов = "Обработка";

КонецПроцедуры

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура КА2_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,
													   Источники,
													   ПодключенныеОтчетыИОбработки,
													   Команды) Экспорт

	Если НастройкиФормы.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаСписка" Тогда
		КА2_ПодключаемыеКомандыВызовСервера.ДобавитьКомандуОтборПоКаталогуАвтомобилей(Команды, НастройкиФормы);
		КА2_ПодключаемыеКомандыВызовСервера.ДобавитьКомандуДобавитьМодели(Команды, НастройкиФормы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти